/**
 * @author IIInsomnia
 */
var cityData = {
    hot: [{
        'pid': 1,
        'pname': '北京',
        'id': 2,
        'name': '北京市'
    }, {
        'pid': 21,
        'pname': '上海',
        'id': 22,
        'name': '上海市'
    }, {
        'pid': 423,
        'pname': '广东',
        'id': 424,
        'name': '广州市'
    }, {
        'pid': 423,
        'pname': '广东',
        'id': 524,
        'name': '深圳市'
    }, {
        'pid': 1643,
        'pname': '江苏',
        'id': 1644,
        'name': '南京市'
    }, {
        'pid': 42,
        'pname': '天津',
        'id': 43,
        'name': '天津市'
    }],
    province: [
               {
                   name: "安徽",
                   city: [
                       {
                           name: "安庆",
                           code: "340800",
                           id: "140"
                       },
                       {
                           name: "蚌埠",
                           code: "340300",
                           id: "135"
                       },
                       {
                           name: "亳州",
                           code: "341600",
                           id: "147"
                       },
                       {
                           name: "巢湖",
                           code: "341400",
                           id: "145"
                       },
                       {
                           name: "池州",
                           code: "341700",
                           id: "148"
                       },
                       {
                           name: "滁州",
                           code: "341100",
                           id: "142"
                       },
                       {
                           name: "阜阳",
                           code: "341200",
                           id: "143"
                       },
                       {
                           name: "合肥",
                           code: "340100",
                           id: "133"
                       },
                       {
                           name: "淮北",
                           code: "340600",
                           id: "138"
                       },
                       {
                           name: "淮南",
                           code: "340400",
                           id: "136"
                       },
                       {
                           name: "黄山",
                           code: "341000",
                           id: "141"
                       },
                       {
                           name: "六安",
                           code: "341500",
                           id: "146"
                       },
                       {
                           name: "马鞍山",
                           code: "340500",
                           id: "137"
                       },
                       {
                           name: "宿州",
                           code: "341300",
                           id: "144"
                       },
                       {
                           name: "铜陵",
                           code: "340700",
                           id: "139"
                       },
                       {
                           name: "芜湖",
                           code: "340200",
                           id: "134"
                       },
                       {
                           name: "宣城",
                           code: "341800",
                           id: "149"
                       }
                   ],
                   code: "340000",
                   id: "13"
               },
               {
                   name: "北京",
                   city: [
                       {
                           name: "市辖区",
                           code: "110100",
                           id: "33"
                       },
                       {
                           name: "县",
                           code: "110200",
                           id: "34"
                       }
                   ],
                   code: "110000",
                   id: "2"
               },
               {
                   name: "重庆",
                   city: [
                       {
                           name: "市辖区",
                           code: "500100",
                           id: "270"
                       },
                       {
                           name: "县",
                           code: "500200",
                           id: "271"
                       }
                   ],
                   code: "500000",
                   id: "23"
               },
               {
                   name: "福建",
                   city: [
                       {
                           name: "福州",
                           code: "350100",
                           id: "150"
                       },
                       {
                           name: "龙岩",
                           code: "350800",
                           id: "157"
                       },
                       {
                           name: "南平",
                           code: "350700",
                           id: "156"
                       },
                       {
                           name: "宁德",
                           code: "350900",
                           id: "158"
                       },
                       {
                           name: "莆田",
                           code: "350300",
                           id: "152"
                       },
                       {
                           name: "泉州",
                           code: "350500",
                           id: "154"
                       },
                       {
                           name: "三明",
                           code: "350400",
                           id: "153"
                       },
                       {
                           name: "厦门",
                           code: "350200",
                           id: "151"
                       },
                       {
                           name: "漳州",
                           code: "350600",
                           id: "155"
                       }
                   ],
                   code: "350000",
                   id: "14"
               },
               {
                   name: "甘肃",
                   city: [
                       {
                           name: "白银",
                           code: "620400",
                           id: "339"
                       },
                       {
                           name: "定西",
                           code: "621100",
                           id: "346"
                       },
                       {
                           name: "甘南藏族自治州",
                           code: "623000",
                           id: "349"
                       },
                       {
                           name: "嘉峪关",
                           code: "620200",
                           id: "337"
                       },
                       {
                           name: "金昌",
                           code: "620300",
                           id: "338"
                       },
                       {
                           name: "酒泉",
                           code: "620900",
                           id: "344"
                       },
                       {
                           name: "兰州",
                           code: "620100",
                           id: "336"
                       },
                       {
                           name: "临夏回族自治州",
                           code: "622900",
                           id: "348"
                       },
                       {
                           name: "陇南",
                           code: "621200",
                           id: "347"
                       },
                       {
                           name: "平凉",
                           code: "620800",
                           id: "343"
                       },
                       {
                           name: "庆阳",
                           code: "621000",
                           id: "345"
                       },
                       {
                           name: "天水",
                           code: "620500",
                           id: "340"
                       },
                       {
                           name: "武威",
                           code: "620600",
                           id: "341"
                       },
                       {
                           name: "张掖",
                           code: "620700",
                           id: "342"
                       }
                   ],
                   code: "620000",
                   id: "29"
               },
               {
                   name: "广东",
                   city: [
                       {
                           name: "潮州",
                           code: "445100",
                           id: "250"
                       },
                       {
                           name: "东莞",
                           code: "441900",
                           id: "248"
                       },
                       {
                           name: "佛山",
                           code: "440600",
                           id: "237"
                       },
                       {
                           name: "广州",
                           code: "440100",
                           id: "232"
                       },
                       {
                           name: "河源",
                           code: "441600",
                           id: "245"
                       },
                       {
                           name: "惠州",
                           code: "441300",
                           id: "242"
                       },
                       {
                           name: "江门",
                           code: "440700",
                           id: "238"
                       },
                       {
                           name: "揭阳",
                           code: "445200",
                           id: "251"
                       },
                       {
                           name: "茂名",
                           code: "440900",
                           id: "240"
                       },
                       {
                           name: "梅州",
                           code: "441400",
                           id: "243"
                       },
                       {
                           name: "清远",
                           code: "441800",
                           id: "247"
                       },
                       {
                           name: "汕头",
                           code: "440500",
                           id: "236"
                       },
                       {
                           name: "汕尾",
                           code: "441500",
                           id: "244"
                       },
                       {
                           name: "韶关",
                           code: "440200",
                           id: "233"
                       },
                       {
                           name: "深圳",
                           code: "440300",
                           id: "234"
                       },
                       {
                           name: "阳江",
                           code: "441700",
                           id: "246"
                       },
                       {
                           name: "云浮",
                           code: "445300",
                           id: "252"
                       },
                       {
                           name: "湛江",
                           code: "440800",
                           id: "239"
                       },
                       {
                           name: "肇庆",
                           code: "441200",
                           id: "241"
                       },
                       {
                           name: "中山",
                           code: "442000",
                           id: "249"
                       },
                       {
                           name: "珠海",
                           code: "440400",
                           id: "235"
                       }
                   ],
                   code: "440000",
                   id: "20"
               },
               {
                   name: "广西",
                   city: [
                       {
                           name: "百色",
                           code: "451000",
                           id: "262"
                       },
                       {
                           name: "北海",
                           code: "450500",
                           id: "257"
                       },
                       {
                           name: "崇左",
                           code: "451400",
                           id: "266"
                       },
                       {
                           name: "防城港",
                           code: "450600",
                           id: "258"
                       },
                       {
                           name: "贵港",
                           code: "450800",
                           id: "260"
                       },
                       {
                           name: "桂林",
                           code: "450300",
                           id: "255"
                       },
                       {
                           name: "河池",
                           code: "451200",
                           id: "264"
                       },
                       {
                           name: "贺州",
                           code: "451100",
                           id: "263"
                       },
                       {
                           name: "来宾",
                           code: "451300",
                           id: "265"
                       },
                       {
                           name: "柳州",
                           code: "450200",
                           id: "254"
                       },
                       {
                           name: "南宁",
                           code: "450100",
                           id: "253"
                       },
                       {
                           name: "钦州",
                           code: "450700",
                           id: "259"
                       },
                       {
                           name: "梧州",
                           code: "450400",
                           id: "256"
                       },
                       {
                           name: "玉林",
                           code: "450900",
                           id: "261"
                       }
                   ],
                   code: "450000",
                   id: "21"
               },
               {
                   name: "贵州",
                   city: [
                       {
                           name: "安顺",
                           code: "520400",
                           id: "297"
                       },
                       {
                           name: "毕节地区",
                           code: "522400",
                           id: "300"
                       },
                       {
                           name: "贵阳",
                           code: "520100",
                           id: "294"
                       },
                       {
                           name: "六盘水",
                           code: "520200",
                           id: "295"
                       },
                       {
                           name: "黔东南苗族侗族自治州",
                           code: "522600",
                           id: "301"
                       },
                       {
                           name: "黔南布依族苗族自治州",
                           code: "522700",
                           id: "302"
                       },
                       {
                           name: "黔西南布依族苗族自治州",
                           code: "522300",
                           id: "299"
                       },
                       {
                           name: "铜仁地区",
                           code: "522200",
                           id: "298"
                       },
                       {
                           name: "遵义",
                           code: "520300",
                           id: "296"
                       }
                   ],
                   code: "520000",
                   id: "25"
               },
               {
                   name: "海南",
                   city: [
                       {
                           name: "海口",
                           code: "460100",
                           id: "267"
                       },
                       {
                           name: "三亚",
                           code: "460200",
                           id: "268"
                       },
                       {
                           name: "省直辖县级行政区划",
                           code: "469000",
                           id: "269"
                       }
                   ],
                   code: "460000",
                   id: "22"
               },
               {
                   name: "河北",
                   city: [
                       {
                           name: "保定",
                           code: "130600",
                           id: "42"
                       },
                       {
                           name: "沧州",
                           code: "130900",
                           id: "45"
                       },
                       {
                           name: "承德",
                           code: "130800",
                           id: "44"
                       },
                       {
                           name: "邯郸",
                           code: "130400",
                           id: "40"
                       },
                       {
                           name: "衡水",
                           code: "131100",
                           id: "47"
                       },
                       {
                           name: "廊坊",
                           code: "131000",
                           id: "46"
                       },
                       {
                           name: "秦皇岛",
                           code: "130300",
                           id: "39"
                       },
                       {
                           name: "石家庄",
                           code: "130100",
                           id: "37"
                       },
                       {
                           name: "唐山",
                           code: "130200",
                           id: "38"
                       },
                       {
                           name: "邢台",
                           code: "130500",
                           id: "41"
                       },
                       {
                           name: "张家口",
                           code: "130700",
                           id: "43"
                       }
                   ],
                   code: "130000",
                   id: "4"
               },
               {
                   name: "黑龙江",
                   city: [
                       {
                           name: "大兴安岭地区",
                           code: "232700",
                           id: "106"
                       },
                       {
                           name: "大庆",
                           code: "230600",
                           id: "99"
                       },
                       {
                           name: "哈尔滨",
                           code: "230100",
                           id: "94"
                       },
                       {
                           name: "鹤岗",
                           code: "230400",
                           id: "97"
                       },
                       {
                           name: "黑河",
                           code: "231100",
                           id: "104"
                       },
                       {
                           name: "佳木斯",
                           code: "230800",
                           id: "101"
                       },
                       {
                           name: "鸡西",
                           code: "230300",
                           id: "96"
                       },
                       {
                           name: "牡丹江",
                           code: "231000",
                           id: "103"
                       },
                       {
                           name: "齐齐哈尔",
                           code: "230200",
                           id: "95"
                       },
                       {
                           name: "七台河",
                           code: "230900",
                           id: "102"
                       },
                       {
                           name: "双鸭山",
                           code: "230500",
                           id: "98"
                       },
                       {
                           name: "绥化",
                           code: "231200",
                           id: "105"
                       },
                       {
                           name: "伊春",
                           code: "230700",
                           id: "100"
                       }
                   ],
                   code: "230000",
                   id: "9"
               },
               {
                   name: "河南",
                   city: [
                       {
                           name: "安阳",
                           code: "410500",
                           id: "191"
                       },
                       {
                           name: "鹤壁",
                           code: "410600",
                           id: "192"
                       },
                       {
                           name: "焦作",
                           code: "410800",
                           id: "194"
                       },
                       {
                           name: "开封",
                           code: "410200",
                           id: "188"
                       },
                       {
                           name: "漯河",
                           code: "411100",
                           id: "197"
                       },
                       {
                           name: "洛阳",
                           code: "410300",
                           id: "189"
                       },
                       {
                           name: "南阳",
                           code: "411300",
                           id: "199"
                       },
                       {
                           name: "平顶山",
                           code: "410400",
                           id: "190"
                       },
                       {
                           name: "濮阳",
                           code: "410900",
                           id: "195"
                       },
                       {
                           name: "三门峡",
                           code: "411200",
                           id: "198"
                       },
                       {
                           name: "商丘",
                           code: "411400",
                           id: "200"
                       },
                       {
                           name: "新乡",
                           code: "410700",
                           id: "193"
                       },
                       {
                           name: "信阳",
                           code: "411500",
                           id: "201"
                       },
                       {
                           name: "许昌",
                           code: "411000",
                           id: "196"
                       },
                       {
                           name: "郑州",
                           code: "410100",
                           id: "187"
                       },
                       {
                           name: "周口",
                           code: "411600",
                           id: "202"
                       },
                       {
                           name: "驻马店",
                           code: "411700",
                           id: "203"
                       }
                   ],
                   code: "410000",
                   id: "17"
               },
               {
                   name: "湖北",
                   city: [
                       {
                           name: "恩施土家族苗族自治州",
                           code: "422800",
                           id: "216"
                       },
                       {
                           name: "鄂州",
                           code: "420700",
                           id: "209"
                       },
                       {
                           name: "黄冈",
                           code: "421100",
                           id: "213"
                       },
                       {
                           name: "黄石",
                           code: "420200",
                           id: "205"
                       },
                       {
                           name: "荆门",
                           code: "420800",
                           id: "210"
                       },
                       {
                           name: "荆州",
                           code: "421000",
                           id: "212"
                       },
                       {
                           name: "省直辖县级行政区划",
                           code: "429000",
                           id: "217"
                       },
                       {
                           name: "十堰",
                           code: "420300",
                           id: "206"
                       },
                       {
                           name: "随州",
                           code: "421300",
                           id: "215"
                       },
                       {
                           name: "武汉",
                           code: "420100",
                           id: "204"
                       },
                       {
                           name: "襄樊",
                           code: "420600",
                           id: "208"
                       },
                       {
                           name: "咸宁",
                           code: "421200",
                           id: "214"
                       },
                       {
                           name: "孝感",
                           code: "420900",
                           id: "211"
                       },
                       {
                           name: "宜昌",
                           code: "420500",
                           id: "207"
                       }
                   ],
                   code: "420000",
                   id: "18"
               },
               {
                   name: "湖南",
                   city: [
                       {
                           name: "常德",
                           code: "430700",
                           id: "224"
                       },
                       {
                           name: "长沙",
                           code: "430100",
                           id: "218"
                       },
                       {
                           name: "郴州",
                           code: "431000",
                           id: "227"
                       },
                       {
                           name: "衡阳",
                           code: "430400",
                           id: "221"
                       },
                       {
                           name: "怀化",
                           code: "431200",
                           id: "229"
                       },
                       {
                           name: "娄底",
                           code: "431300",
                           id: "230"
                       },
                       {
                           name: "邵阳",
                           code: "430500",
                           id: "222"
                       },
                       {
                           name: "湘潭",
                           code: "430300",
                           id: "220"
                       },
                       {
                           name: "湘西土家族苗族自治州",
                           code: "433100",
                           id: "231"
                       },
                       {
                           name: "益阳",
                           code: "430900",
                           id: "226"
                       },
                       {
                           name: "永州",
                           code: "431100",
                           id: "228"
                       },
                       {
                           name: "岳阳",
                           code: "430600",
                           id: "223"
                       },
                       {
                           name: "张家界",
                           code: "430800",
                           id: "225"
                       },
                       {
                           name: "株洲",
                           code: "430200",
                           id: "219"
                       }
                   ],
                   code: "430000",
                   id: "19"
               },
               {
                   name: "江苏",
                   city: [
                       {
                           name: "常州",
                           code: "320400",
                           id: "112"
                       },
                       {
                           name: "淮安",
                           code: "320800",
                           id: "116"
                       },
                       {
                           name: "连云港",
                           code: "320700",
                           id: "115"
                       },
                       {
                           name: "南京",
                           code: "320100",
                           id: "109"
                       },
                       {
                           name: "南通",
                           code: "320600",
                           id: "114"
                       },
                       {
                           name: "宿迁",
                           code: "321300",
                           id: "121"
                       },
                       {
                           name: "苏州",
                           code: "320500",
                           id: "113"
                       },
                       {
                           name: "泰州",
                           code: "321200",
                           id: "120"
                       },
                       {
                           name: "无锡",
                           code: "320200",
                           id: "110"
                       },
                       {
                           name: "徐州",
                           code: "320300",
                           id: "111"
                       },
                       {
                           name: "盐城",
                           code: "320900",
                           id: "117"
                       },
                       {
                           name: "扬州",
                           code: "321000",
                           id: "118"
                       },
                       {
                           name: "镇江",
                           code: "321100",
                           id: "119"
                       }
                   ],
                   code: "320000",
                   id: "11"
               },
               {
                   name: "江西",
                   city: [
                       {
                           name: "赣州",
                           code: "360700",
                           id: "165"
                       },
                       {
                           name: "吉安",
                           code: "360800",
                           id: "166"
                       },
                       {
                           name: "景德镇",
                           code: "360200",
                           id: "160"
                       },
                       {
                           name: "九江",
                           code: "360400",
                           id: "162"
                       },
                       {
                           name: "南昌",
                           code: "360100",
                           id: "159"
                       },
                       {
                           name: "萍乡",
                           code: "360300",
                           id: "161"
                       },
                       {
                           name: "上饶",
                           code: "361100",
                           id: "169"
                       },
                       {
                           name: "抚州",
                           code: "361000",
                           id: "168"
                       },
                       {
                           name: "新余",
                           code: "360500",
                           id: "163"
                       },
                       {
                           name: "宜春",
                           code: "360900",
                           id: "167"
                       },
                       {
                           name: "鹰潭",
                           code: "360600",
                           id: "164"
                       }
                   ],
                   code: "360000",
                   id: "15"
               },
               {
                   name: "吉林",
                   city: [
                       {
                           name: "白城",
                           code: "220800",
                           id: "92"
                       },
                       {
                           name: "白山",
                           code: "220600",
                           id: "90"
                       },
                       {
                           name: "长春",
                           code: "220100",
                           id: "85"
                       },
                       {
                           name: "吉林",
                           code: "220200",
                           id: "86"
                       },
                       {
                           name: "辽源",
                           code: "220400",
                           id: "88"
                       },
                       {
                           name: "四平",
                           code: "220300",
                           id: "87"
                       },
                       {
                           name: "松原",
                           code: "220700",
                           id: "91"
                       },
                       {
                           name: "通化",
                           code: "220500",
                           id: "89"
                       },
                       {
                           name: "延边朝鲜族自治州",
                           code: "222400",
                           id: "93"
                       }
                   ],
                   code: "220000",
                   id: "8"
               },
               {
                   name: "辽宁",
                   city: [
                       {
                           name: "鞍山",
                           code: "210300",
                           id: "73"
                       },
                       {
                           name: "本溪",
                           code: "210500",
                           id: "75"
                       },
                       {
                           name: "朝阳",
                           code: "211300",
                           id: "83"
                       },
                       {
                           name: "大连",
                           code: "210200",
                           id: "72"
                       },
                       {
                           name: "丹东",
                           code: "210600",
                           id: "76"
                       },
                       {
                           name: "抚顺",
                           code: "210400",
                           id: "74"
                       },
                       {
                           name: "阜新",
                           code: "210900",
                           id: "79"
                       },
                       {
                           name: "葫芦岛",
                           code: "211400",
                           id: "84"
                       },
                       {
                           name: "锦州",
                           code: "210700",
                           id: "77"
                       },
                       {
                           name: "辽阳",
                           code: "211000",
                           id: "80"
                       },
                       {
                           name: "盘锦",
                           code: "211100",
                           id: "81"
                       },
                       {
                           name: "沈阳",
                           code: "210100",
                           id: "71"
                       },
                       {
                           name: "铁岭",
                           code: "211200",
                           id: "82"
                       },
                       {
                           name: "营口",
                           code: "210800",
                           id: "78"
                       }
                   ],
                   code: "210000",
                   id: "7"
               },
               {
                   name: "内蒙古",
                   city: [
                       {
                           name: "阿拉善盟",
                           code: "152900",
                           id: "70"
                       },
                       {
                           name: "包头",
                           code: "150200",
                           id: "60"
                       },
                       {
                           name: "巴彦淖尔",
                           code: "150800",
                           id: "66"
                       },
                       {
                           name: "赤峰",
                           code: "150400",
                           id: "62"
                       },
                       {
                           name: "鄂尔多斯",
                           code: "150600",
                           id: "64"
                       },
                       {
                           name: "兴安盟",
                           code: "152200",
                           id: "68"
                       },
                       {
                           name: "呼和浩特",
                           code: "150100",
                           id: "59"
                       },
                       {
                           name: "呼伦贝尔",
                           code: "150700",
                           id: "65"
                       },
                       {
                           name: "通辽",
                           code: "150500",
                           id: "63"
                       },
                       {
                           name: "乌海",
                           code: "150300",
                           id: "61"
                       },
                       {
                           name: "乌兰察布",
                           code: "150900",
                           id: "67"
                       },
                       {
                           name: "锡林郭勒盟",
                           code: "152500",
                           id: "69"
                       }
                   ],
                   code: "150000",
                   id: "6"
               },
               {
                   name: "宁夏",
                   city: [
                       {
                           name: "固原",
                           code: "640400",
                           id: "361"
                       },
                       {
                           name: "石嘴山",
                           code: "640200",
                           id: "359"
                       },
                       {
                           name: "吴忠",
                           code: "640300",
                           id: "360"
                       },
                       {
                           name: "银川",
                           code: "640100",
                           id: "358"
                       },
                       {
                           name: "中卫",
                           code: "640500",
                           id: "362"
                       }
                   ],
                   code: "640000",
                   id: "31"
               },
               {
                   name: "青海",
                   city: [
                       {
                           name: "果洛藏族自治州",
                           code: "632600",
                           id: "355"
                       },
                       {
                           name: "海北藏族自治州",
                           code: "632200",
                           id: "352"
                       },
                       {
                           name: "海东地区",
                           code: "632100",
                           id: "351"
                       },
                       {
                           name: "海南藏族自治州",
                           code: "632500",
                           id: "354"
                       },
                       {
                           name: "海西蒙古族藏族自治州",
                           code: "632800",
                           id: "357"
                       },
                       {
                           name: "黄南藏族自治州",
                           code: "632300",
                           id: "353"
                       },
                       {
                           name: "西宁",
                           code: "630100",
                           id: "350"
                       },
                       {
                           name: "玉树藏族自治州",
                           code: "632700",
                           id: "356"
                       }
                   ],
                   code: "630000",
                   id: "30"
               },
               {
                   name: "山东",
                   city: [
                       {
                           name: "滨州",
                           code: "371600",
                           id: "185"
                       },
                       {
                           name: "德州",
                           code: "371400",
                           id: "183"
                       },
                       {
                           name: "东营",
                           code: "370500",
                           id: "174"
                       },
                       {
                           name: "菏泽",
                           code: "371700",
                           id: "186"
                       },
                       {
                           name: "济南",
                           code: "370100",
                           id: "170"
                       },
                       {
                           name: "济宁",
                           code: "370800",
                           id: "177"
                       },
                       {
                           name: "莱芜",
                           code: "371200",
                           id: "181"
                       },
                       {
                           name: "聊城",
                           code: "371500",
                           id: "184"
                       },
                       {
                           name: "临沂",
                           code: "371300",
                           id: "182"
                       },
                       {
                           name: "青岛",
                           code: "370200",
                           id: "171"
                       },
                       {
                           name: "日照",
                           code: "371100",
                           id: "180"
                       },
                       {
                           name: "泰安",
                           code: "370900",
                           id: "178"
                       },
                       {
                           name: "潍坊",
                           code: "370700",
                           id: "176"
                       },
                       {
                           name: "威海",
                           code: "371000",
                           id: "179"
                       },
                       {
                           name: "烟台",
                           code: "370600",
                           id: "175"
                       },
                       {
                           name: "枣庄",
                           code: "370400",
                           id: "173"
                       },
                       {
                           name: "淄博",
                           code: "370300",
                           id: "172"
                       }
                   ],
                   code: "370000",
                   id: "16"
               },
               {
                   name: "上海",
                   city: [
                       {
                           name: "市辖区",
                           code: "310100",
                           id: "107"
                       },
                       {
                           name: "县",
                           code: "310200",
                           id: "108"
                       }
                   ],
                   code: "310000",
                   id: "10"
               },
               {
                   name: "山西",
                   city: [
                       {
                           name: "长治",
                           code: "140400",
                           id: "51"
                       },
                       {
                           name: "大同",
                           code: "140200",
                           id: "49"
                       },
                       {
                           name: "晋城",
                           code: "140500",
                           id: "52"
                       },
                       {
                           name: "晋中",
                           code: "140700",
                           id: "54"
                       },
                       {
                           name: "临汾",
                           code: "141000",
                           id: "57"
                       },
                       {
                           name: "吕梁",
                           code: "141100",
                           id: "58"
                       },
                       {
                           name: "朔州",
                           code: "140600",
                           id: "53"
                       },
                       {
                           name: "太原",
                           code: "140100",
                           id: "48"
                       },
                       {
                           name: "忻州",
                           code: "140900",
                           id: "56"
                       },
                       {
                           name: "阳泉",
                           code: "140300",
                           id: "50"
                       },
                       {
                           name: "运城",
                           code: "140800",
                           id: "55"
                       }
                   ],
                   code: "140000",
                   id: "5"
               },
               {
                   name: "陕西",
                   city: [
                       {
                           name: "安康",
                           code: "610900",
                           id: "334"
                       },
                       {
                           name: "宝鸡",
                           code: "610300",
                           id: "328"
                       },
                       {
                           name: "汉中",
                           code: "610700",
                           id: "332"
                       },
                       {
                           name: "商洛",
                           code: "611000",
                           id: "335"
                       },
                       {
                           name: "铜川",
                           code: "610200",
                           id: "327"
                       },
                       {
                           name: "渭南",
                           code: "610500",
                           id: "330"
                       },
                       {
                           name: "西安",
                           code: "610100",
                           id: "326"
                       },
                       {
                           name: "咸阳",
                           code: "610400",
                           id: "329"
                       },
                       {
                           name: "延安",
                           code: "610600",
                           id: "331"
                       },
                       {
                           name: "榆林",
                           code: "610800",
                           id: "333"
                       }
                   ],
                   code: "610000",
                   id: "28"
               },
               {
                   name: "四川",
                   city: [
                       {
                           name: "阿坝藏族羌族自治州",
                           code: "513200",
                           id: "291"
                       },
                       {
                           name: "巴中",
                           code: "511900",
                           id: "289"
                       },
                       {
                           name: "成都",
                           code: "510100",
                           id: "273"
                       },
                       {
                           name: "达州",
                           code: "511700",
                           id: "287"
                       },
                       {
                           name: "德阳",
                           code: "510600",
                           id: "277"
                       },
                       {
                           name: "甘孜藏族自治州",
                           code: "513300",
                           id: "292"
                       },
                       {
                           name: "广安",
                           code: "511600",
                           id: "286"
                       },
                       {
                           name: "广元",
                           code: "510800",
                           id: "279"
                       },
                       {
                           name: "乐山",
                           code: "511100",
                           id: "282"
                       },
                       {
                           name: "凉山彝族自治州",
                           code: "513400",
                           id: "293"
                       },
                       {
                           name: "泸州",
                           code: "510500",
                           id: "276"
                       },
                       {
                           name: "眉山",
                           code: "511400",
                           id: "284"
                       },
                       {
                           name: "绵阳",
                           code: "510700",
                           id: "278"
                       },
                       {
                           name: "南充",
                           code: "511300",
                           id: "283"
                       },
                       {
                           name: "内江",
                           code: "511000",
                           id: "281"
                       },
                       {
                           name: "攀枝花",
                           code: "510400",
                           id: "275"
                       },
                       {
                           name: "遂宁",
                           code: "510900",
                           id: "280"
                       },
                       {
                           name: "雅安",
                           code: "511800",
                           id: "288"
                       },
                       {
                           name: "宜宾",
                           code: "511500",
                           id: "285"
                       },
                       {
                           name: "自贡",
                           code: "510300",
                           id: "274"
                       },
                       {
                           name: "资阳",
                           code: "512000",
                           id: "290"
                       }
                   ],
                   code: "510000",
                   id: "24"
               },
               {
                   name: "台湾",
                   city: [
                       {
                           name: "高雄",
                           code: "800",
                           id: "5009"
                       },
                       {
                           name: "嘉义",
                           code: "600",
                           id: "5013"
                       },
                       {
                           name: "花莲",
                           code: "950",
                           id: "5016"
                       },
                       {
                           name: "南投",
                           code: "540",
                           id: "5012"
                       },
                       {
                           name: "新北",
                           code: "220",
                           id: "5006"
                       },
                       {
                           name: "澎湖",
                           code: "880",
                           id: "5015"
                       },
                       {
                           name: "屏东",
                           code: "900",
                           id: "5010"
                       },
                       {
                           name: "台南",
                           code: "700",
                           id: "5008"
                       },
                       {
                           name: "台北",
                           code: "222",
                           id: "5005"
                       },
                       {
                           name: "台东",
                           code: "210",
                           id: "5011"
                       },
                       {
                           name: "台中",
                           code: "400",
                           id: "5007"
                       },
                       {
                           name: "桃园",
                           code: "330",
                           id: "5017"
                       },
                       {
                           name: "新竹",
                           code: "300",
                           id: "5018"
                       },
                       {
                           name: "宜兰",
                           code: "260",
                           id: "5019"
                       },
                       {
                           name: "云林",
                           code: "640",
                           id: "5014"
                       },
                       {
                           name: "彰化",
                           code: "500",
                           id: "5020"
                       }
                   ],
                   code: "999079",
                   id: "5004"
               },
               {
                   name: "特别行政区",
                   city: [
                       {
                           name: "香港",
                           code: "999077",
                           id: "5002"
                       },
                       {
                           name: "澳门",
                           code: "999078",
                           id: "5003"
                       }
                   ],
                   code: "特别行政区",
                   id: "5001"
               },
               {
                   name: "天津",
                   city: [
                       {
                           name: "市辖区",
                           code: "120100",
                           id: "35"
                       },
                       {
                           name: "县",
                           code: "120200",
                           id: "36"
                       }
                   ],
                   code: "120000",
                   id: "3"
               },
               {
                   name: "新疆",
                   city: [
                       {
                           name: "阿克苏地区",
                           code: "652900",
                           id: "370"
                       },
                       {
                           name: "阿勒泰地区",
                           code: "654300",
                           id: "376"
                       },
                       {
                           name: "巴音郭楞蒙古自治州",
                           code: "652800",
                           id: "369"
                       },
                       {
                           name: "博尔塔拉蒙古自治州",
                           code: "652700",
                           id: "368"
                       },
                       {
                           name: "昌吉回族自治州",
                           code: "652300",
                           id: "367"
                       },
                       {
                           name: "哈密地区",
                           code: "652200",
                           id: "366"
                       },
                       {
                           name: "和田地区",
                           code: "653200",
                           id: "373"
                       },
                       {
                           name: "伊犁哈萨克自治州",
                           code: "654000",
                           id: "374"
                       },
                       {
                           name: "克拉玛依",
                           code: "650200",
                           id: "364"
                       },
                       {
                           name: "喀什地区",
                           code: "653100",
                           id: "372"
                       },
                       {
                           name: "克孜勒苏柯尔克孜自治州",
                           code: "653000",
                           id: "371"
                       },
                       {
                           name: "塔城地区",
                           code: "654200",
                           id: "375"
                       },
                       {
                           name: "吐鲁番地区",
                           code: "652100",
                           id: "365"
                       },
                       {
                           name: "乌鲁木齐",
                           code: "650100",
                           id: "363"
                       },
                       {
                           name: "自治区直辖县级行政区划",
                           code: "659000",
                           id: "377"
                       }
                   ],
                   code: "650000",
                   id: "32"
               },
               {
                   name: "西藏",
                   city: [
                       {
                           name: "拉萨",
                           code: "540100",
                           id: "319"
                       },
                       {
                           name: "那曲地区",
                           code: "542400",
                           id: "323"
                       },
                       {
                           name: "阿里地区",
                           code: "542500",
                           id: "324"
                       },
                       {
                           name: "林芝地区",
                           code: "542600",
                           id: "325"
                       },
                       {
                           name: "昌都地区",
                           code: "542100",
                           id: "320"
                       },
                       {
                           name: "山南地区",
                           code: "542200",
                           id: "321"
                       },
                       {
                           name: "日喀则地区",
                           code: "542300",
                           id: "322"
                       }
                   ],
                   code: "540000",
                   id: "27"
               },
               {
                   name: "云南",
                   city: [
                       {
                           name: "保山",
                           code: "530500",
                           id: "306"
                       },
                       {
                           name: "楚雄彝族自治州",
                           code: "532300",
                           id: "311"
                       },
                       {
                           name: "大理白族自治州",
                           code: "532900",
                           id: "315"
                       },
                       {
                           name: "德宏傣族景颇族自治州",
                           code: "533100",
                           id: "316"
                       },
                       {
                           name: "迪庆藏族自治州",
                           code: "533400",
                           id: "318"
                       },
                       {
                           name: "红河哈尼族彝族自治州",
                           code: "532500",
                           id: "312"
                       },
                       {
                           name: "昆明",
                           code: "530100",
                           id: "303"
                       },
                       {
                           name: "丽江",
                           code: "530700",
                           id: "308"
                       },
                       {
                           name: "临沧",
                           code: "530900",
                           id: "310"
                       },
                       {
                           name: "怒江傈僳族自治州",
                           code: "533300",
                           id: "317"
                       },
                       {
                           name: "曲靖",
                           code: "530300",
                           id: "304"
                       },
                       {
                           name: "普洱",
                           code: "530800",
                           id: "309"
                       },
                       {
                           name: "文山壮族苗族自治州",
                           code: "532600",
                           id: "313"
                       },
                       {
                           name: "西双版纳傣族自治州",
                           code: "532800",
                           id: "314"
                       },
                       {
                           name: "玉溪",
                           code: "530400",
                           id: "305"
                       },
                       {
                           name: "昭通",
                           code: "530600",
                           id: "307"
                       }
                   ],
                   code: "530000",
                   id: "26"
               },
               {
                   name: "浙江",
                   city: [
                       {
                           name: "杭州",
                           code: "330100",
                           id: "122"
                       },
                       {
                           name: "湖州",
                           code: "330500",
                           id: "126"
                       },
                       {
                           name: "嘉兴",
                           code: "330400",
                           id: "125"
                       },
                       {
                           name: "金华",
                           code: "330700",
                           id: "128"
                       },
                       {
                           name: "丽水",
                           code: "331100",
                           id: "132"
                       },
                       {
                           name: "宁波",
                           code: "330200",
                           id: "123"
                       },
                       {
                           name: "衢州",
                           code: "330800",
                           id: "129"
                       },
                       {
                           name: "绍兴",
                           code: "330600",
                           id: "127"
                       },
                       {
                           name: "台州",
                           code: "331000",
                           id: "131"
                       },
                       {
                           name: "温州",
                           code: "330300",
                           id: "124"
                       },
                       {
                           name: "舟山",
                           code: "330900",
                           id: "130"
                       }
                   ],
                   code: "330000",
                   id: "12"
               }
           ]
};